Documents/УЧ_КорректировкаРеализации.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.14">
	<Document>
		<Properties>
			<Name>УЧ_КорректировкаРеализации</Name>
			<BasedOn>
				<xr:Item>Document.УЧ_Реализация</xr:Item>
			</BasedOn>
			<Posting>Allow</Posting>
			<RegisterRecords>
				<xr:Item>AccountingRegister.Учетный</xr:Item>
			</RegisterRecords>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>Предприятие</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Предприятия</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Контрагент</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Контрагенты</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Договор</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ДоговорыКонтрагентов</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СчетКонтрагента</Name>
					<Type>
						<v8:Type>cfg:ChartOfAccountsRef.Учетный</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Подразделение</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.СтруктураПредприятия</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Комментарий</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>150</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ФлагВалюты</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Валюта</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Валюты</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Курс</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>12</v8:Digits>
							<v8:FractionDigits>5</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>УчитыватьНДС</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДокОснование</Name>
					<Type>
						<v8:Type>cfg:DocumentRef.УЧ_Реализация</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Организация</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Организации</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>НомерВходящегоДокумента</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>30</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДатаВходящегоДокумента</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Склад</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Склады</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СуммаИтог</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>17</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СуммаНДСИтог</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>17</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ЦенаВключаетНДС</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>РучнаяКорректировка</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Автор</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Пользователи</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Редактор</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Пользователи</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СуммаДокумента</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>17</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>Товары</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Номенклатура</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.Номенклатура</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Склад</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.Склады</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>КоличествоДоИзменения</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>3</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Количество</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>3</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ЦенаДоИзменения</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>17</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Цена</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>17</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>СуммаДоИзменения</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>17</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Сумма</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>17</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>СтавкаНДСДоИзменения</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.СтавкиНДС</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>СтавкаНДС</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.СтавкиНДС</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>СуммаНДСДоИзменения</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>СуммаНДС</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>АлкогольнаяПродукция</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>10</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ЕстьВДокументеРеализация</Name>
							<Type>
								<v8:Type>xs:boolean</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Счет</Name>
							<Type>
								<v8:Type>cfg:ChartOfAccountsRef.Учетный</v8:Type>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
			<TabularSection>
				<Properties>
					<Name>УчетПартий</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Номенклатура</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.Номенклатура</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Количество</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>3</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>СуммаБезНДС</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>СуммаНДС</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ВидДвижения</Name>
							<Type>
								<v8:Type>cfg:EnumRef.ВидДвиженияНакопления</v8:Type>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</Document>
</MetaDataObject>

Documents/УЧ_КорректировкаРеализации/Ext/ManagerModule.bsl
Процедура ЗаполнитьПоДокументуОснованию(Объект) Экспорт
	
	Если Не ЗначениеЗаполнено(Объект.ДокОснование) Тогда
		Возврат;
	КонецЕсли;
	
	Объект.Товары.Очистить();
	
	Если ТипЗнч(Объект.ДокОснование) = Тип("ДокументСсылка.УЧ_Реализация") Тогда
		// Заполнение шапки
		
		Запрос = новый Запрос;
		Запрос.Текст = "ВЫБРАТЬ
		               |	УЧ_Реализация.Ссылка КАК Ссылка,
		               |	УЧ_Реализация.Предприятие КАК Предприятие,
		               |	УЧ_Реализация.Контрагент КАК Контрагент,
		               |	УЧ_Реализация.Договор КАК Договор,
		               |	УЧ_Реализация.Подразделение КАК Подразделение,
		               |	УЧ_Реализация.ФлагВалюты КАК ФлагВалюты,
		               |	УЧ_Реализация.Валюта КАК Валюта,
		               |	УЧ_Реализация.Курс КАК Курс,
		               |	УЧ_Реализация.УчитыватьНДС КАК УчитыватьНДС,
		               |	УЧ_Реализация.Организация КАК Организация,
		               |	УЧ_Реализация.Склад КАК Склад,
		               |	УЧ_Реализация.УчетПартий.(
		               |		Ссылка КАК Ссылка,
		               |		НомерСтроки КАК НомерСтроки,
		               |		Номенклатура КАК Номенклатура,
		               |		Количество КАК Количество,
		               |		СуммаБезНДС КАК СуммаБезНДС,
		               |		СуммаНДС КАК СуммаНДС,
		               |		ВидДвижения КАК ВидДвижения
		               |	) КАК УчетПартий,
		               |	УЧ_Реализация.Товары.(
		               |		Ссылка КАК Ссылка,
		               |		НомерСтроки КАК НомерСтроки,
		               |		Счет КАК Счет,
		               |		Номенклатура КАК Номенклатура,
		               |		Склад КАК Склад,
		               |		Количество КАК Количество,
		               |		КоличествоКРХ КАК КоличествоКРХ,
		               |		Цена КАК Цена,
		               |		Доставка КАК Доставка,
		               |		СуммаОтгрузки КАК СуммаОтгрузки,
		               |		СуммаДоставки КАК СуммаДоставки,
		               |		ВидДоставки КАК ВидДоставки,
		               |		ВнеобАктивы КАК ВнеобАктивы,
		               |		ДоставкаАвто КАК ДоставкаАвто,
		               |		СуммаДоставкиАвто КАК СуммаДоставкиАвто,
		               |		Расстояние КАК Расстояние,
		               |		СуммаДоставкиНачислено КАК СуммаДоставкиНачислено,
		               |		КорСчет КАК КорСчет,
		               |		КорСубконто1 КАК КорСубконто1,
		               |		КорСубконто2 КАК КорСубконто2,
		               |		КорСубконто3 КАК КорСубконто3,
		               |		Основание КАК Основание,
		               |		СуммаВерха КАК СуммаВерха,
		               |		Счет76 КАК Счет76,
		               |		ВерхКонтрагент КАК ВерхКонтрагент,
		               |		Верх КАК Верх,
		               |		ПроцВерха КАК ПроцВерха,
		               |		ЦенаКлиента КАК ЦенаКлиента,
		               |		ВидДеятельности КАК ВидДеятельности,
		               |		СтавкаНДС КАК СтавкаНДС,
		               |		Сумма КАК Сумма,
		               |		СуммаНДС КАК СуммаНДС,
		               |		ПроцентАвтоматическихСкидок КАК ПроцентАвтоматическихСкидок,
		               |		ПроцентСкидкиНаценки КАК ПроцентСкидкиНаценки,
		               |		АбсолютнаяСкидка КАК АбсолютнаяСкидка,
		               |		Характеристика КАК Характеристика,
		               |		Штрихкод КАК Штрихкод
		               |	) КАК Товары,
		               |	УЧ_Реализация.Счет КАК СчетКонтрагента
		               |ИЗ
		               |	Документ.УЧ_Реализация КАК УЧ_Реализация
		               |ГДЕ
		               |	УЧ_Реализация.Ссылка = &Ссылка";
		Запрос.УстановитьПараметр("Ссылка", Объект.ДокОснование);
		Выборка = Запрос.Выполнить().Выбрать();
		Если Выборка.Следующий() Тогда
			
			ЗаполнитьЗначенияСвойств(Объект, Выборка,, "УчетПартий, Товары");
			//Объект.Дата = ТекущаяДата();
			Объект.ЦенаВключаетНДС = Истина;  //в Реализации подразумеваем, что всегда включает
			
			ВыборкаТЧ = Выборка.Товары.Выбрать();
			Пока ВыборкаТЧ.Следующий() Цикл
				НоваяСтрока = Объект.Товары.Добавить();
				//НоваяСтрока.АлкогольнаяПродукция 	= ВыборкаТЧ.АлкогольнаяПродукция;
				НоваяСтрока.КоличествоДоИзменения 	= ВыборкаТЧ.Количество;
				НоваяСтрока.Количество 				= ВыборкаТЧ.Количество;
				НоваяСтрока.Номенклатура 	= ВыборкаТЧ.Номенклатура;
				НоваяСтрока.Склад 			= ВыборкаТЧ.Склад;
				НоваяСтрока.СтавкаНДСДоИзменения 	= ВыборкаТЧ.СтавкаНДС;
				НоваяСтрока.СтавкаНДС 				= ВыборкаТЧ.СтавкаНДС;
				НоваяСтрока.СуммаДоИзменения 	= ВыборкаТЧ.Сумма;
				НоваяСтрока.Сумма 				= ВыборкаТЧ.Сумма;
				НоваяСтрока.СуммаНДСДоИзменения = ВыборкаТЧ.СуммаНДС;
				НоваяСтрока.СуммаНДС 			= ВыборкаТЧ.СуммаНДС;
				НоваяСтрока.ЦенаДоИзменения 	= ВыборкаТЧ.Цена;
				НоваяСтрока.Цена 				= ВыборкаТЧ.Цена;
				НоваяСтрока.Счет				= ВыборкаТЧ.Счет;
				НоваяСтрока.ЕстьВДокументеРеализация = Истина;
			КонецЦикла;
			
			ВыборкаУчетПартий = Выборка.УчетПартий.Выбрать();
			Пока ВыборкаУчетПартий.Следующий() Цикл
				
				НоваяСтрока = Объект.УчетПартий.Добавить();
				НоваяСтрока.Номенклатура = ВыборкаУчетПартий.Номенклатура;
				//НоваяСтрока.КоличествоДоИзменения 	= ВыборкаУчетПартий.Количество;
				НоваяСтрока.Количество 				= ВыборкаУчетПартий.Количество;
				//НоваяСтрока.СуммаБезНДСДоИзменения 	= ВыборкаУчетПартий.СуммаБезНДС;
				НоваяСтрока.СуммаБезНДС 			= ВыборкаУчетПартий.СуммаБезНДС;
				//НоваяСтрока.СуммаНДСДоИзменения 	= ВыборкаУчетПартий.СуммаНДС;
				НоваяСтрока.СуммаНДС 				= ВыборкаУчетПартий.СуммаНДС;
				НоваяСтрока.ВидДвижения 			= ВыборкаУчетПартий.ВидДвижения;
				//НоваяСтрока.ЕстьВДокументеПоступления = Истина;
				
			КонецЦикла;
			
		КонецЕсли;
	КонецЕсли;
	
КонецПроцедуры
